Autodesk.Revit.DB.StructuralAsset.Equals(Autodesk.Revit.DB.StructuralAsset)
Determines whether this structural asset is equal to another.
other:
The structural asset with which to compare this structural asset.
Returns:
True if the given structural asset is equal to this one, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.StructuralAsset.Name
The name of the structural asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.StructuralAsset.SubClass
The sub-class of the asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodGrade
The grade of wood used in a wood-based asset.
Remarks:
Applies to wood-based structural assets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodSpecies
The species of wood used in a wood-based asset.
Remarks:
Applies to wood-based structural assets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.MetalThermallyTreated
Flag indicating whether the asset describes a material that is thermally treated or not.
Remarks:
Applies to Metal-based structural assets.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be Metal to set this property.
Since:
2021

Autodesk.Revit.DB.StructuralAsset.ThermalExpansionCoefficient
The thermal expansion coefficient of the asset.
Remarks:
This property cannot be used to set the thermal expansion coefficient for wood-based and isotropic materials.
For such assets, use setThermalExpansionCoefficient instead.
The value is in inverse Kelvin (1/K).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type is wood.
-or-
When setting this property: the behavior is isotropic.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.ShearModulus
The shear modulus of the asset.
Remarks:
This property cannot be used to set the shear modulus for wood-based and isotropic materials.
For such assets, use setShearModulus instead.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type is wood.
-or-
When setting this property: the behavior is isotropic.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.PoissonRatio
The Poisson ratio of the asset.
Remarks:
This property cannot be used to set the Poisson ratio for wood-based and isotropic materials.
For such assets, use setPoissonRatio instead.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type is wood.
-or-
When setting this property: the behavior is isotropic.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.YoungModulus
The Young's modulus of the asset.
Remarks:
This property cannot be used to set the Young's modulus for wood-based and isotropic materials.
For such assets, use setYoungModulus instead.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type is wood.
-or-
When setting this property: the behavior is isotropic.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.#ctor(System.String,Autodesk.Revit.DB.StructuralAssetClass)
Constructs an instance of StructuralAsset.
name:
The name of the asset.
structuralAssetClass:
The type of structural material that this asset will describe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013